app/controllers/api/v1/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @post = Post.find_by_id(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.find_by_id(params[:news_id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      @comment = Comment.find_by_id(params[:id])
      if @comment.nil?
        render json: { error: 'not found' }, status: 404
      elsif @post.comments.include?(@comment)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = Post.find_by_id(params[:id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      if !check_params_create
        render json: { error: 'params error' }, status: 400
      else
        @comment = @post.comments.new(commenter: params[:author], body: params[:comment])
        if @comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 3], ["LIMIT", 1]]
---
  def update
    @post = Post.find_by_id(params[:news_id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      @comment = Comment.find_by_id(params[:id])
      if @comment.nil?
        render json: { error: 'not found' }, status: 404
      else
        if !@post.comments.include?(@comment)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
---
  def destroy
    @post = Post.find_by_id(params[:news_id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      @comment = Comment.find_by_id(params[:id])
      if @comment.nil?
        render json: { error: 'not found' }, status: 404
      elsif @post.comments.include?(@comment)
        @comment.delete