app/controllers/api/v1/news_controller.rb

  def create
    if !check_params_create
      render json: { error: 'params error' }, status: 400
    else
      if params[:subtitle].present?
        @post = Post.new(title: params[:title], lead: params[:subtitle], body: params[:body])
      else
        @post = Post.new(title: params[:title], lead: 'no subtitle', body: params[:body])
      end
      if @post.save
---
INSERT INTO "posts" ("title", "lead", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @post = Post.find_by_id(params[:id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      if !check_params_update
        render json: { error: 'not updated' }, status: 400
      else
        if @post.update_attributes(update_new_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Nuevo título de la noticia"], ["updated_at", "2018-04-03 21:02:26.800773"], ["id", 1]]

  def destroy
    @post = Post.find_by_id(params[:id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      @post.delete
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]

  def comment_index
    @post = Post.find_by_id(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def comment_create
    @post = Post.find_by_id(params[:id])
    if @post.nil?
      render json: { error: 'not found' }, status: 404
    else
      if !check_params_create_comment
        render json: { error: 'params error' }, status: 400
      else
        @comment = @post.comments.new(commenter: params[:author], body: params[:comment])
        if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Autor del comentario"], ["body", "contenido del comentario"], ["post_id", 1], ["created_at", "2018-04-03 21:20:33.737446"], ["updated_at", "2018-04-03 21:20:33.737446"]]